In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

In [2]:
# Naive's theorem - 
# condition event - Probability of an event
0.2*0.35/(0.2*0.35 + 0.5*0.4 + 0.3*0.25)

0.20289855072463764

In [6]:
(0.2*0.35 + 0.5*0.4 + 0.3*0.25)

0.34500000000000003

In [5]:
0.20289855072463764 + 0.5797101449275363 + 0.21739130434782605

0.9999999999999999

In [3]:
0.5*0.4/(0.2*0.35 + 0.5*0.4 + 0.3*0.25)

0.5797101449275363

In [4]:
0.3*0.25/(0.2*0.35 + 0.5*0.4 + 0.3*0.25)

0.21739130434782605

In [9]:
# Series - Uni directional
labels = ["a", "b", "c", "d"]
my_list = [1,2,3,5]
arr = np.array([10,20,30])
d={"a": 15, "b": 18, "c":50}

In [12]:
pd.Series(data=my_list)

0    1
1    2
2    3
3    5
dtype: int64

In [13]:
pd.Series(data=my_list, index=labels)

a    1
b    2
c    3
d    5
dtype: int64

In [20]:
series1 = pd.Series([1,2,3,4,5], index=["India", "USA", "Germany", "Russia", "Japan"])
series1

India      1
USA        2
Germany    3
Russia     4
Japan      5
dtype: int64

In [21]:
series2 = pd.Series([4,7,8,1,6], index=["India", "USA", "Italy", "Russia", "Japan"])
series2

India     4
USA       7
Italy     8
Russia    1
Japan     6
dtype: int64

In [18]:
series1+series2

Germany     NaN
India       5.0
Italy       NaN
Japan      11.0
Russia      5.0
USA         9.0
dtype: float64

In [19]:
series1["Russia"]

4

In [22]:
series1["India"]

1

In [35]:
series1["Italy"] # Key Error when element not present

KeyError: 'Italy'

In [36]:
# Dataframe - Bi-directional

df = pd.DataFrame(np.random.rand(8,5), index=["A","B", "C", "D", "E", "F", "G", "H"], 
                  columns="Score1 Score2 Score3 Score4 Score5".split(' '))
df

     Score1    Score2    Score3    Score4    Score5
A  0.422149  0.955062  0.207836  0.142269  0.067399
B  0.127880  0.572042  0.566248  0.919694  0.872230
C  0.144199  0.138289  0.094175  0.561447  0.769008
D  0.012138  0.861548  0.129805  0.798321  0.609666
E  0.144078  0.382805  0.277785  0.124945  0.524306
F  0.827846  0.292246  0.669582  0.382006  0.849341
G  0.787986  0.881905  0.368464  0.445170  0.401789
H  0.207324  0.375800  0.619792  0.011604  0.214257

In [40]:
df[["Score1", "Score2"]] # display two columns

     Score1    Score2
A  0.422149  0.955062
B  0.127880  0.572042
C  0.144199  0.138289
D  0.012138  0.861548
E  0.144078  0.382805
F  0.827846  0.292246
G  0.787986  0.881905
H  0.207324  0.375800

In [44]:
df["Score6"] = df["Score1"]+df["Score2"]
df

     Score1    Score2    Score3    Score4    Score5    Score6
A  0.422149  0.955062  0.207836  0.142269  0.067399  1.377211
B  0.127880  0.572042  0.566248  0.919694  0.872230  0.699922
C  0.144199  0.138289  0.094175  0.561447  0.769008  0.282488
D  0.012138  0.861548  0.129805  0.798321  0.609666  0.873686
E  0.144078  0.382805  0.277785  0.124945  0.524306  0.526883
F  0.827846  0.292246  0.669582  0.382006  0.849341  1.120092
G  0.787986  0.881905  0.368464  0.445170  0.401789  1.669891
H  0.207324  0.375800  0.619792  0.011604  0.214257  0.583123

In [45]:
df.drop("Score1", axis=1)
df

     Score1    Score2    Score3    Score4    Score5    Score6
A  0.422149  0.955062  0.207836  0.142269  0.067399  1.377211
B  0.127880  0.572042  0.566248  0.919694  0.872230  0.699922
C  0.144199  0.138289  0.094175  0.561447  0.769008  0.282488
D  0.012138  0.861548  0.129805  0.798321  0.609666  0.873686
E  0.144078  0.382805  0.277785  0.124945  0.524306  0.526883
F  0.827846  0.292246  0.669582  0.382006  0.849341  1.120092
G  0.787986  0.881905  0.368464  0.445170  0.401789  1.669891
H  0.207324  0.375800  0.619792  0.011604  0.214257  0.583123

In [46]:
df1 = df.drop("Score1", axis=1)
df1

     Score2    Score3    Score4    Score5    Score6
A  0.955062  0.207836  0.142269  0.067399  1.377211
B  0.572042  0.566248  0.919694  0.872230  0.699922
C  0.138289  0.094175  0.561447  0.769008  0.282488
D  0.861548  0.129805  0.798321  0.609666  0.873686
E  0.382805  0.277785  0.124945  0.524306  0.526883
F  0.292246  0.669582  0.382006  0.849341  1.120092
G  0.881905  0.368464  0.445170  0.401789  1.669891
H  0.375800  0.619792  0.011604  0.214257  0.583123

In [48]:
df2 = df.drop("Score1", axis=1, inplace=True)
df2

KeyError: "['Score1'] not found in axis"

In [49]:
dict = {"ID": [1,2,3,4,5], "Name": ["John", "Mercy", "Akash", "Lally", "Kavin"], "Marks": [67,28,11,90,12]}

df1 = pd.DataFrame(dict)
df1

   ID   Name  Marks
0   1   John     67
1   2  Mercy     28
2   3  Akash     11
3   4  Lally     90
4   5  Kavin     12

In [50]:
df1[["Name", "ID"]] # Display Name, ID coumns

    Name  ID
0   John   1
1  Mercy   2
2  Akash   3
3  Lally   4
4  Kavin   5

In [51]:
df2 = df1.drop("ID", axis=1)

In [52]:
df2

    Name  Marks
0   John     67
1  Mercy     28
2  Akash     11
3  Lally     90
4  Kavin     12

In [54]:
update_df = df2.drop(2)
update_df

    Name  Marks
0   John     67
1  Mercy     28
3  Lally     90
4  Kavin     12

In [57]:
dict1 = {
    "Company": ["GooG","GooG","MSFT","MSFT","FB", "FB"], 
    "Person": ["SAM", "Charlie", "Amy", "Vanessa", "Carl", "Sarah"], 
    "Sales": [200,120,340,124,243, 350]
}

df3 = pd.DataFrame(dict1)
df3

  Company   Person  Sales
0    GooG      SAM    200
1    GooG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [59]:
df3["Sales"].mean()

229.5

In [60]:
df3["Sales"].max()

350

In [61]:
df3["Sales"].min()

120

In [62]:
df3["Sales"].count()

6

In [63]:
df3["Sales"].std()

100.89945490437498

In [64]:
df3.describe(include="all")

       Company Person       Sales
count        6      6    6.000000
unique       3      6         NaN
top       GooG    SAM         NaN
freq         2      1         NaN
mean       NaN    NaN  229.500000
std        NaN    NaN  100.899455
min        NaN    NaN  120.000000
25%        NaN    NaN  143.000000
50%        NaN    NaN  221.500000
75%        NaN    NaN  315.750000
max        NaN    NaN  350.000000

In [65]:
fb_data = df3[df3['Company'] == 'FB']

In [68]:
fb_data

  Company Person  Sales
4      FB   Carl    243
5      FB  Sarah    350

In [70]:
fb_data["Sales"].mean()

296.5

In [71]:
fb_data["Sales"].max()

350

In [72]:
fb_data["Sales"].min()

243

In [74]:
fb_data["Sales"].std()

75.66042558696059

In [75]:
fb_data.describe()

            Sales
count    2.000000
mean   296.500000
std     75.660426
min    243.000000
25%    269.750000
50%    296.500000
75%    323.250000
max    350.000000

In [79]:
company_statistics = df3.groupby('Company')['Sales'].describe()
company_statistics

         count   mean         std    min     25%    50%     75%    max
Company
FB         2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GooG       2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT       2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [80]:
df3.groupby('Company')['Sales'].mean()

Company
FB      296.5
GooG    160.0
MSFT    232.0
Name: Sales, dtype: float64

In [90]:
for comp in df3['Company'].unique():
    print("\n======= company name =====", comp)
    data_set = df3[df3['Company'] == comp]
    print("Mean::", data_set["Sales"].mean())
    print("MIn::", data_set["Sales"].min())
    print("Max::", data_set["Sales"].max())
    print("Std::", data_set["Sales"].std())
    print("Count::", data_set.count())
    print("\n Description:::::::")
    print("Desc::\n", data_set.describe())

======= company name ===== GooG
Mean:: 160.0
Mean:: 120
Mean:: 200
Std:: 56.568542494923804
Count:: Company    2
Person     2
Sales      2
dtype: int64

 Description:::::::
Desc::
             Sales
count    2.000000
mean   160.000000
std     56.568542
min    120.000000
25%    140.000000
50%    160.000000
75%    180.000000
max    200.000000

======= company name ===== MSFT
Mean:: 232.0
Mean:: 124
Mean:: 340
Std:: 152.73506473629428
Count:: Company    2
Person     2
Sales      2
dtype: int64

 Description:::::::
Desc::
             Sales
count    2.000000
mean   232.000000
std    152.735065
min    124.000000
25%    178.000000
50%    232.000000
75%    286.000000
max    340.000000

======= company name ===== FB
Mean:: 296.5
Mean:: 243
Mean:: 350
Std:: 75.66042558696059
Count:: Company    2
Person     2
Sales      2
dtype: int64

 Description:::::::
Desc::
             Sales
count    2.000000
mean   296.500000
std     75.660426
min    243.000000
25%    269.750000
50%    296.500000
75%    323.250000
max    350.000000